SiliconLabs/matter_extension/third_party/matter_sdk/src/platform/silabs/efr32/BLEManagerImpl.cpp
            ChipLogProgress(DeviceLayer, "BLE GATT connection closed (con %u, reason %u)", conn_evt->connection, conn_evt->reason);

            PlatformMgr().PostEventOrDie(&event);

            // Arrange to re-enable connectable advertising in case it was disabled due to the
            // maximum connection limit being reached.
            mFlags.Set(Flags::kRestartAdvertising);
            mFlags.Set(Flags::kFastAdvertisingEnabled);
        }

        TEMPORARY_RETURN_IGNORED PlatformMgr().ScheduleWork(DriveBLEState, 0);
    }
    return eventFilter;
}

BLEManagerImpl::EventFilter BLEManagerImpl::HandleWriteEvent(volatile sl_bt_msg_t * evt)
{
    EventFilter eventFilter = EventFilter::UnprocessedEvent;
    if (GetConnectionState(evt->data.evt_gatt_server_user_write_request.connection))
    {
        eventFilter        = EventFilter::MatterReservedEvent;
        uint16_t attribute = evt->data.evt_gatt_server_user_write_request.characteristic;
        bool do_provision  = chip::DeviceLayer::Silabs::Provision::Manager::GetInstance().IsProvisionRequired();
        ChipLogProgress(DeviceLayer, "Char Write Req, char : %d", attribute);

        if (gattdb_CHIPoBLEChar_Rx == attribute)
        {
            if (do_provision)
            {
                TEMPORARY_RETURN_IGNORED chip::DeviceLayer::Silabs::Provision::Channel::Update(attribute);
                chip::DeviceLayer::Silabs::Provision::Manager::GetInstance().Step();
            }
            else
            {
                HandleRXCharWrite(evt);
            }
        }
    }
    else if (isMATTERoBLECharacteristic(evt->data.evt_gatt_server_user_write_request.characteristic))
    {
        // Prevent to write CHIPoBLE Characteristics from other connections
        // This will fail if the characteristic has the WRITE_NO_RESPONSE property
        eventFilter = EventFilter::MatterReservedEvent;
        sl_bt_gatt_server_send_user_write_response(evt->data.evt_gatt_server_user_write_request.connection,
                                                   evt->data.evt_gatt_server_user_write_request.characteristic, 0x01);
    }

    return eventFilter;
}

BLEManagerImpl::EventFilter BLEManagerImpl::HandleTXCharCCCDWrite(volatile sl_bt_msg_t * evt)
{
    CHIP_ERROR err          = CHIP_NO_ERROR;
    EventFilter eventFilter = EventFilter::UnprocessedEvent;

    if (isMATTERoBLECharacteristic(evt->data.evt_gatt_server_user_write_request.characteristic))
    {
        eventFilter                = EventFilter::MatterReservedEvent;
        BLEConState * bleConnState = GetConnectionState(evt->data.evt_gatt_server_user_write_request.connection);

        // Silent fail when bleConnState == nullptr.
        // We don't own the connection but it is trying to write a MatterOBle Characteristic
        VerifyOrReturnValue(bleConnState != nullptr, eventFilter);

        if ((evt->data.evt_gatt_server_characteristic_status.characteristic == gattdb_CHIPoBLEChar_Tx) &&
            (evt->data.evt_gatt_server_characteristic_status.status_flags == sl_bt_gatt_server_client_config))
        {
            bool isIndicationEnabled = false;
            ChipDeviceEvent event;
            // Determine if the client is enabling or disabling notification/indication.
            isIndicationEnabled = (evt->data.evt_gatt_server_characteristic_status.client_config_flags == sl_bt_gatt_indication);

            ChipLogProgress(DeviceLayer, "HandleTXcharCCCDWrite - Config Flags value : %d",
                            evt->data.evt_gatt_server_characteristic_status.client_config_flags);
            ChipLogProgress(DeviceLayer, "CHIPoBLE %s received", isIndicationEnabled ? "subscribe" : "unsubscribe");

            if (isIndicationEnabled)
            {
                // If indications are not already enabled for the connection...
                if (!bleConnState->subscribed)
                {
                    bleConnState->subscribed = 1;
                    // Post an event to the CHIP queue to process either a CHIPoBLE Subscribe or Unsubscribe based on
                    // whether the client is enabling or disabling indications.
                    {
                        event.Type                    = DeviceEventType::kCHIPoBLESubscribe;
                        event.CHIPoBLESubscribe.ConId = evt->data.evt_gatt_server_user_write_request.connection;
                        err                           = PlatformMgr().PostEvent(&event);
                    }
                }
            }
            else
            {
                bleConnState->subscribed      = 0;
                event.Type                    = DeviceEventType::kCHIPoBLEUnsubscribe;
                event.CHIPoBLESubscribe.ConId = evt->data.evt_gatt_server_user_write_request.connection;
                err                           = PlatformMgr().PostEvent(&event);
            }
        }
    }

    LogErrorOnFailure(err);
    return eventFilter;
}

void BLEManagerImpl::HandleRXCharWrite(volatile sl_bt_msg_t * evt)
{
    CHIP_ERROR err = CHIP_NO_ERROR;
    System::PacketBufferHandle buf;
    uint16_t writeLen = evt->data.evt_gatt_server_user_write_request.value.len;
    uint8_t * data    = (uint8_t *) evt->data.evt_gatt_server_user_write_request.value.data;

    // Copy the data to a packet buffer.
    buf = System::PacketBufferHandle::NewWithData(data, writeLen, 0, 0);
    VerifyOrExit(!buf.IsNull(), err = CHIP_ERROR_NO_MEMORY);

    ChipLogDetail(DeviceLayer, "Write request/command received for CHIPoBLE RX characteristic (con %u, len %u)",
                  evt->data.evt_gatt_server_user_write_request.connection, buf->DataLength());

    // Post an event to the CHIP queue to deliver the data into the CHIP stack.
    {
        ChipDeviceEvent event;
        event.Type                        = DeviceEventType::kCHIPoBLEWriteReceived;
        event.CHIPoBLEWriteReceived.ConId = evt->data.evt_gatt_server_user_write_request.connection;
        event.CHIPoBLEWriteReceived.Data  = std::move(buf).UnsafeRelease();
        err                               = PlatformMgr().PostEvent(&event);
    }

