SiliconLabs/matter_extension/third_party/matter_sdk/src/platform/silabs/efr32/BLEManagerImpl.cpp
void BLEManagerImpl::StartBleAdvTimeoutTimer(uint32_t aTimeoutInMs)
{
    if (osTimerStart(sbleAdvTimeoutTimer, pdMS_TO_TICKS(aTimeoutInMs)) != osOK)
    {
        ChipLogError(DeviceLayer, "Failed to start BledAdv timeout timer");
    }
}

void BLEManagerImpl::DriveBLEState(intptr_t arg)
{
    sInstance.DriveBLEState();
}

bool BLEManagerImpl::CanHandleEvent(uint32_t event)
{
    return (event == sl_bt_evt_system_boot_id || event == sl_bt_evt_connection_opened_id ||
            event == sl_bt_evt_connection_parameters_id || event == sl_bt_evt_connection_phy_status_id ||
            event == sl_bt_evt_connection_data_length_id || event == sl_bt_evt_connection_closed_id ||
            event == sl_bt_evt_gatt_server_attribute_value_id || event == sl_bt_evt_gatt_mtu_exchanged_id ||
            event == sl_bt_evt_gatt_server_characteristic_status_id || event == sl_bt_evt_system_soft_timer_id ||
            event == sl_bt_evt_gatt_server_user_read_request_id || event == sl_bt_evt_connection_remote_used_features_id);
}

BLEManagerImpl::EventFilter BLEManagerImpl::ParseEvent(volatile sl_bt_msg_t * evt)
{
    EventFilter eventFilter = EventFilter::UnprocessedEvent;
    VerifyOrReturnValue(CanHandleEvent(SL_BT_MSG_ID(evt->header)), eventFilter);
    // As this is running in a separate thread, and we determined this is a matter related event,
    // we need to block CHIP from operating, until the events are handled.
    // Todo: Move inside the MatteroBLE channel once created and verify if lock is necessary for other channels
    // Ideally at this level we just want to pick the channel and the each channel can have its own switch case
    chip::DeviceLayer::PlatformMgr().LockChipStack();

    switch (SL_BT_MSG_ID(evt->header))
    {
    case sl_bt_evt_system_boot_id: {
        ChipLogProgress(DeviceLayer, "BLE stack: v%d.%d.%d-b%d", evt->data.evt_system_boot.major, evt->data.evt_system_boot.minor,
                        evt->data.evt_system_boot.patch, evt->data.evt_system_boot.build);
        HandleBootEvent();

        RAIL_Version_t railVer;
        RAIL_GetVersion(&railVer, true);
        ChipLogProgress(DeviceLayer, "RAIL: v%d.%d.%d-b%d", railVer.major, railVer.minor, railVer.rev, railVer.build);
        sl_bt_connection_set_default_parameters(BLE_CONFIG_MIN_INTERVAL, BLE_CONFIG_MAX_INTERVAL, BLE_CONFIG_LATENCY,
                                                BLE_CONFIG_TIMEOUT, BLE_CONFIG_MIN_CE_LENGTH, BLE_CONFIG_MAX_CE_LENGTH);

        eventFilter = EventFilter::SharableEvent;
    }
    break;

    case sl_bt_evt_connection_opened_id: {
        eventFilter = HandleConnectEvent(evt);
    }
    break;
    case sl_bt_evt_connection_parameters_id: {
        eventFilter = HandleConnectParams(evt);
    }
    break;
    case sl_bt_evt_connection_phy_status_id: {
        eventFilter = GetConnectionState(evt->data.evt_connection_phy_status.connection) ? EventFilter::MatterReservedEvent
                                                                                         : EventFilter::UnprocessedEvent;
        if (eventFilter == EventFilter::MatterReservedEvent)
        {
            ChipLogProgress(DeviceLayer, "Connection phy status ID received - phy:%d", evt->data.evt_connection_phy_status.phy);
        }
    }
    break;
    case sl_bt_evt_connection_data_length_id: {
        eventFilter = GetConnectionState(evt->data.evt_connection_data_length.connection) ? EventFilter::MatterReservedEvent
                                                                                          : EventFilter::UnprocessedEvent;
        if (eventFilter == EventFilter::MatterReservedEvent)
        {
            ChipLogProgress(DeviceLayer, "Connection data length ID received - txL:%d, txT:%d, rxL:%d, rxL:%d",
                            evt->data.evt_connection_data_length.tx_data_len, evt->data.evt_connection_data_length.tx_time_us,
                            evt->data.evt_connection_data_length.rx_data_len, evt->data.evt_connection_data_length.rx_time_us);
        }
    }
    break;
    case sl_bt_evt_connection_closed_id: {
        eventFilter = HandleConnectionCloseEvent(evt);
    }
    break;

    /* This event indicates that a remote GATT client is attempting to write a value of an
     * attribute in to the local GATT database, where the attribute was defined in the GATT
     * XML firmware configuration file to have type="user".  */
    case sl_bt_evt_gatt_server_attribute_value_id: {
        eventFilter = HandleWriteEvent(evt);
    }
    break;

    case sl_bt_evt_gatt_mtu_exchanged_id: {
        eventFilter = UpdateMtu(evt);
    }
    break;

    // confirmation of indication received from remote GATT client
    case sl_bt_evt_gatt_server_characteristic_status_id: {
        sl_bt_gatt_server_characteristic_status_flag_t StatusFlags;

        StatusFlags = (sl_bt_gatt_server_characteristic_status_flag_t) evt->data.evt_gatt_server_characteristic_status.status_flags;

        if (sl_bt_gatt_server_confirmation == StatusFlags)
        {
            eventFilter = HandleTxConfirmationEvent(evt->data.evt_gatt_server_characteristic_status.connection);
        }
        else
        {
            eventFilter = HandleTXCharCCCDWrite(evt);
        }
    }
    break;

    /* Software Timer event */
    case sl_bt_evt_system_soft_timer_id: {
        eventFilter = HandleSoftTimerEvent(evt);
    }
    break;

    case sl_bt_evt_gatt_server_user_read_request_id: {
#if CHIP_ENABLE_ADDITIONAL_DATA_ADVERTISING
        eventFilter = HandleC3ReadRequest(evt);
#endif // CHIP_ENABLE_ADDITIONAL_DATA_ADVERTISING
    }
    break;

    case sl_bt_evt_connection_remote_used_features_id: {
        eventFilter = GetConnectionState(evt->data.evt_connection_remote_used_features.connection)
            ? EventFilter::MatterReservedEvent
            : EventFilter::UnprocessedEvent;
    }
    break;

    default: {
        ChipLogDetail(DeviceLayer, "evt_UNKNOWN id = %08" PRIx32, SL_BT_MSG_ID(evt->header));
        break;
    }
    }

    // Unlock the stack
    chip::DeviceLayer::PlatformMgr().UnlockChipStack();
    return eventFilter;
}

} // namespace Internal
} // namespace DeviceLayer
} // namespace chip
#ifdef SL_CATALOG_MATTER_BLE_DMP_TEST_PRESENT
extern "C" void zigbee_bt_on_event(volatile sl_bt_msg_t * evt);
#endif // SL_CATALOG_MATTER_BLE_DMP_TEST_PRESENT

// TODO: Move this to matter_bl_event.cpp and update gn and slc build files
extern "C" void sl_bt_on_event(sl_bt_msg_t * evt)
{
    [[maybe_unused]] chip::DeviceLayer::Internal::BLEManagerImpl::EventFilter eventFilter;
    eventFilter = chip::DeviceLayer::Internal::BLEMgrImpl().ParseEvent(evt);

#if SL_BLE_SIDE_CHANNEL_ENABLED
    if (chip::DeviceLayer::Internal::BLEMgrImpl().GetSideChannel() != nullptr &&
        eventFilter != chip::DeviceLayer::Internal::BLEManagerImpl::EventFilter::MatterReservedEvent)
    {
        // The side channel may process events directly.
        chip::DeviceLayer::Internal::BLEMgrImpl().GetSideChannel()->ParseEvent(evt);
    }
#endif

#ifdef SL_CATALOG_MATTER_BLE_DMP_TEST_PRESENT
    zigbee_bt_on_event(evt);
#endif // SL_CATALOG_MATTER_BLE_DMP_TEST_PRESENT
}

#endif // CHIP_DEVICE_CONFIG_ENABLE_CHIPOBLE
